fix(docs): update links in documentation for consistency and accuracy, use mermaid instead of ascii arts
